app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', '80ae1ad7b8984583162b569aca415aa235cce61f', '2010-02-06 12:59:55', 'ec8cc7f54799d9c207c0c8f6ee33dbd89d25c9c0', NULL, '2010-02-06 12:59:55', NULL, 'demo', 'targinosilveira@targinosilveira.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save